app/controllers/admin/orders_controller.rb

  def create
    @admin_order = Order.new(admin_order_params)

    respond_to do |format|
      if @admin_order.save
---
INSERT INTO "orders" ("customer_email", "fulfilled", "total", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["customer_email", "0677777777"], ["fulfilled", false], ["total", 3000], ["address", "Тернопіль"], ["created_at", "2026-06-03 12:58:27.974289"], ["updated_at", "2026-06-03 12:58:27.974289"]]

  def destroy
    @admin_order.destroy!
---
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 2]]

    def set_admin_order
      @admin_order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]