app/views/admin/orders/_order.html.erb


  <% if order.order_products.any? %>
    <strong class="block font-medium mb-1">Товари:</strong>
    <% order.order_products.each do |op| %>
---
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = $1  [["order_id", 4]]
SELECT 1 AS one FROM "order_products" WHERE "order_products"."order_id" = $1 LIMIT $2  [["order_id", 1], ["LIMIT", 1]]