app/views/admin/products/_form.html.erb

    <%= form.label "Категорія" %>
    <%= form.collection_select :category_id, Category.order(:name), :id, :name, id: "category", class: "block shadow rounded-md border border-orange-200 outline-none px-3 py-2 mt-2 w-full" %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC