app/controllers/admin_controller.rb

  def index
    @not_fulfilled_pagy, @not_fulfilled_orders = pagy(Order.where(fulfilled: false).order(created_at: :asc))
    @fulfilled_pagy, @fulfilled_orders = pagy(Order.where(fulfilled: true).order(created_at: :asc), page_param: :page_fulfilled)
---
SELECT "orders".* FROM "orders" WHERE "orders"."fulfilled" = ? ORDER BY "orders"."created_at" DESC LIMIT ?  [["fulfilled", 0], ["LIMIT", 5]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."fulfilled" = $1  [["fulfilled", true]]