app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    # Only show products that are active and have more than 1 in stock
    @products = @category.products.available.includes(images_attachments: :blob)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ? AND (price <= '40000')  [["category_id", 1]]