app/controllers/checkouts_controller.rb

  def create
    cart = checkout_cart

    if cart.blank?
      flash[:alert] = "Ваш кошик порожній"
      redirect_to cart_path and return
    end

    if params[:order].present?
      @order = Order.new(order_params)
      @order.fulfilled = false
      @order.total = cart.sum { |item| item["price"].to_i * item["quantity"].to_i }

      if @order.save
        create_order_products(@order, cart)
        session[:cart] = nil
        flash[:notice] = "Замовлення успішно створено!"
        redirect_to success_path and return
      end

      render :new, status: :unprocessable_entity and return
    end

    line_items = cart.map do |item|
      product = Product.find(item["id"])
      product_stock = Stock.find_by(product_id: item["id"])
---
INSERT INTO "orders" ("customer_email", "fulfilled", "total", "address", "created_at", "updated_at", "phone") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."product_id" = ? LIMIT ?  [["product_id", 1], ["LIMIT", 1]]

  def create_order_products(order, cart)
    cart.each do |item|
      product = Product.find(item["id"])
      stock = Stock.find_by(product_id: product.id)

      OrderProduct.create!(order: order, product: product, quantity: item["quantity"].to_i, size: item["size"])
      stock&.decrement!(:amount, item["quantity"].to_i)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]
INSERT INTO "order_products" ("product_id", "order_id", "size", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_id", 1], ["order_id", 4], ["size", ""], ["quantity", 1], ["created_at", "2026-06-03 13:34:58.170335"], ["updated_at", "2026-06-03 13:34:58.170335"]]
UPDATE "stocks" SET "amount" = COALESCE("amount", 0) - $1 WHERE "stocks"."id" = $2  [["amount", 1], ["id", 1]]