app/views/products/show.html.erb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."product_id" = $1  [["product_id", 1]]
---
      <p class='uppercase text-lg text-white'>Кількість</p>
      <% @product.stocks.each do |stock| %>